CSI API ETABS v1
cPropArea.GetModifiers Method
 Retrieves the modifier assignments for an area property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetModifiers(
	string Name,
	ref double[] Value
)
Function GetModifiers (
	Name As String,
	ByRef Value As Double()
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetModifiers(Name,
	Value)
int GetModifiers(
	String^ Name,
	array<double>^% Value
)
abstract GetModifiers :
        Name : string *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
The name of an existing area property.
Value
Type: System.Double[]
An array of 10 unitless modifiers.
Value | Modifier
Value(0) | Membrane f11 modifier
Value(1) | Membrane f22 modifier
Value(2) | Membrane f12 modifier
Value(3) | Bending m11 modifier
Value(4) | Bending m22 modifier
Value(5) | Bending m12 modifier
Value(6) | Shear v13 modifier
Value(7) | Shear v23 modifier
Value(8) | Mass modifier
Value(9) | Weight modifier
Return Value
Type: Int32
Returns zero if the modifier assignments are successfully retrieved; otherwise it returns a nonzero value.
Remarks
The default value for all modifiers is one.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim i As Integer
       Dim MyValue() As Double
       Dim Value() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign modifiers
       ReDim MyValue(9)
       For i = 0 To 9
           MyValue(i) = 1
       Next i
       MyValue(0) = 0.1
       ret = SapModel.PropArea.SetModifiers("SLAB1", MyValue)
   'get modifiers
       ret = SapModel.PropArea.GetModifiers("SLAB1", Value)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace